Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration
The Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration class centralizes all configuration options for interactions.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.DefaultLineOpacity
The default value for line opacity.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.DefaultFaceOpacity
The default value of 40% in the alpha channel make pixels show through a background for faces.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.DefaultDimensionFaceOpacity
The default value of full opacity for face handle of dimensions.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.FullOpaque
The pixel has a value of 100% in the alpha channel, it is fully opaque.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.TransparentOpacity
The pixel has a value of 0% in the alpha channel, it is fully transparent.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.GetLineWidth(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic)
Gets the width to apply on a line graphic visualizing the given data.
visualizationData: The data to get the line property for.
Returns: The width to apply on the line.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.GetLineColor(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic)
Gets the color to apply on a line graphic visualizing the given data.
visualizationData: The data to get the line property for.
Returns: The color to apply on the line.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.GetLineType(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic)
Gets the type to apply on a line graphic visualizing the given data.
visualizationData: The data to get the line property for.
Returns: The type to apply on the line.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.GetFaceColor(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic)
Gets the color to apply on a face graphic visualizing the given data.
visualizationData: The data to get the face color for.
Returns: The color to apply on the face.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.GetDefaultColor(Tekla.BIM.DirectManipulation.Services.Interaction.HandleAppearanceType,Tekla.BIM.DirectManipulation.Services.Interaction.HandleColor,System.Double)
Gets the default color for the given handle appearance type.
appearanceType: The handle appearance type.
color: The handle color.
opacity: The opacity to use.
Returns: The default color.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InteractionConfiguration.ToDotColor(Tekla.BIM.DirectManipulation.Services.Interaction.HandleColor,System.Double)
Converts the color from the given HandleColor to dotColor_t.
color: The handle color.
opacity: The opacity to use.
Returns: The color in dotColor_t format.